Pedro-A-Oliveira/RL78L12_SO/src/iodefine.h
/*
 Sfr bits
 */
#define ADCE ADM0_bit.no0
#define ADCS ADM0_bit.no7
#define LCDVLM LCDM1_bit.no0
#define LCDSEL LCDM1_bit.no3
#define BLON LCDM1_bit.no4
#define VLCON LCDM1_bit.no5
#define SCOC LCDM1_bit.no6
#define LCDON LCDM1_bit.no7
#define OPTCKE MLCD_bit.no4
#define COMEXP MLCD_bit.no6
#define LCTZS MLCD_bit.no7
#define SPD0 IICS0_bit.no0
#define STD0 IICS0_bit.no1
#define ACKD0 IICS0_bit.no2
#define TRC0 IICS0_bit.no3
#define COI0 IICS0_bit.no4
#define EXC0 IICS0_bit.no5
#define ALD0 IICS0_bit.no6
#define MSTS0 IICS0_bit.no7
#define IICRSV0 IICF0_bit.no0
#define STCEN0 IICF0_bit.no1
#define IICBSY0 IICF0_bit.no6
#define STCF0 IICF0_bit.no7
#define FSSTP FSSQ_bit.no6
#define SQST FSSQ_bit.no7
#define SQEND FSASTH_bit.no6
#define ESQEND FSASTH_bit.no7
#define RCLOE1 RTCC0_bit.no5
#define RTCE RTCC0_bit.no7
#define RWAIT RTCC1_bit.no0
#define RWST RTCC1_bit.no1
#define RIFG RTCC1_bit.no3
#define WAFG RTCC1_bit.no4
#define WALIE RTCC1_bit.no6
#define WALE RTCC1_bit.no7
#define HIOSTOP CSC_bit.no0
#define XTSTOP CSC_bit.no6
#define MSTOP CSC_bit.no7
#define SDIV CKC_bit.no3
#define MCM0 CKC_bit.no4
#define MCS CKC_bit.no5
#define CSS CKC_bit.no6
#define CLS CKC_bit.no7
#define PCLOE0 CKS0_bit.no7
#define PCLOE1 CKS1_bit.no7
#define LVIF LVIM_bit.no0
#define LVIOMSK LVIM_bit.no1
#define LVISEN LVIM_bit.no7
#define LVILV LVIS_bit.no0
#define LVIMD LVIS_bit.no7
#define DWAIT0 DMC0_bit.no4
#define DS0 DMC0_bit.no5
#define DRS0 DMC0_bit.no6
#define STG0 DMC0_bit.no7
#define DWAIT1 DMC1_bit.no4
#define DS1 DMC1_bit.no5
#define DRS1 DMC1_bit.no6
#define STG1 DMC1_bit.no7
#define DST0 DRC0_bit.no0
#define DEN0 DRC0_bit.no7
#define DST1 DRC1_bit.no0
#define DEN1 DRC1_bit.no7
#define LCIF0 IF2_bit.no0
#define PIF6 IF2_bit.no1
#define PIF7 IF2_bit.no2
#define MDIF IF2_bit.no3
#define FLIF IF2_bit.no4
#define LCMK0 MK2_bit.no0
#define PMK6 MK2_bit.no1
#define PMK7 MK2_bit.no2
#define MDMK MK2_bit.no3
#define FLMK MK2_bit.no4
#define LCPR00 PR02_bit.no0
#define PPR06 PR02_bit.no1
#define PPR07 PR02_bit.no2
#define MDPR0 PR02_bit.no3
#define FLPR0 PR02_bit.no4
#define LCPR10 PR12_bit.no0
#define PPR16 PR12_bit.no1
#define PPR17 PR12_bit.no2
#define MDPR1 PR12_bit.no3
#define FLPR1 PR12_bit.no4
#define WDTIIF IF0_bit.no0
#define LVIIF IF0_bit.no1
#define PIF0 IF0_bit.no2
#define PIF1 IF0_bit.no3
#define PIF2 IF0_bit.no4
#define PIF3 IF0_bit.no5
#define PIF4 IF0_bit.no6
#define PIF5 IF0_bit.no7
#define DMAIF0 IF0H_bit.no0
#define DMAIF1 IF0H_bit.no1
#define CSIIF00 IF0H_bit.no2
#define STIF0 IF0H_bit.no2
#define CSIIF01 IF0H_bit.no3
#define SRIF0 IF0H_bit.no3
#define SREIF0 IF0H_bit.no4
#define TMIF01H IF0H_bit.no4
#define TMIF00 IF0H_bit.no6
#define TMIF03H IF1_bit.no0
#define IICAIF0 IF1_bit.no1
#define TMIF01 IF1_bit.no2
#define TMIF02 IF1_bit.no3
#define TMIF03 IF1_bit.no4
#define ADIF IF1_bit.no5
#define RTCIF IF1_bit.no6
#define ITIF IF1_bit.no7
#define KRIF IF1H_bit.no0
#define TMIF04 IF1H_bit.no4
#define TMIF05 IF1H_bit.no5
#define TMIF06 IF1H_bit.no6
#define TMIF07 IF1H_bit.no7
#define WDTIMK MK0_bit.no0
#define LVIMK MK0_bit.no1
#define PMK0 MK0_bit.no2
#define PMK1 MK0_bit.no3
#define PMK2 MK0_bit.no4
#define PMK3 MK0_bit.no5
#define PMK4 MK0_bit.no6
#define PMK5 MK0_bit.no7
#define DMAMK0 MK0H_bit.no0
#define DMAMK1 MK0H_bit.no1
#define CSIMK00 MK0H_bit.no2
#define STMK0 MK0H_bit.no2
#define CSIMK01 MK0H_bit.no3
#define SRMK0 MK0H_bit.no3
#define SREMK0 MK0H_bit.no4
#define TMMK01H MK0H_bit.no4
#define TMMK00 MK0H_bit.no6
#define TMMK03H MK1_bit.no0
#define IICAMK0 MK1_bit.no1
#define TMMK01 MK1_bit.no2
#define TMMK02 MK1_bit.no3
#define TMMK03 MK1_bit.no4
#define ADMK MK1_bit.no5
#define RTCMK MK1_bit.no6
#define ITMK MK1_bit.no7
#define KRMK MK1H_bit.no0
#define TMMK04 MK1H_bit.no4
#define TMMK05 MK1H_bit.no5
#define TMMK06 MK1H_bit.no6
#define TMMK07 MK1H_bit.no7
#define WDTIPR0 PR00_bit.no0
#define LVIPR0 PR00_bit.no1
#define PPR00 PR00_bit.no2
#define PPR01 PR00_bit.no3
#define PPR02 PR00_bit.no4
#define PPR03 PR00_bit.no5
#define PPR04 PR00_bit.no6
#define PPR05 PR00_bit.no7
#define DMAPR00 PR00H_bit.no0
#define DMAPR01 PR00H_bit.no1
#define CSIPR000 PR00H_bit.no2
#define STPR00 PR00H_bit.no2
#define CSIPR001 PR00H_bit.no3
#define SRPR00 PR00H_bit.no3
#define SREPR00 PR00H_bit.no4
#define TMPR001H PR00H_bit.no4
#define TMPR000 PR00H_bit.no6
#define TMPR003H PR01_bit.no0
#define IICAPR00 PR01_bit.no1
#define TMPR001 PR01_bit.no2
#define TMPR002 PR01_bit.no3
#define TMPR003 PR01_bit.no4
#define ADPR0 PR01_bit.no5
#define RTCPR0 PR01_bit.no6
#define ITPR0 PR01_bit.no7
#define KRPR0 PR01H_bit.no0
#define TMPR004 PR01H_bit.no4
#define TMPR005 PR01H_bit.no5
#define TMPR006 PR01H_bit.no6
#define TMPR007 PR01H_bit.no7
#define WDTIPR1 PR10_bit.no0
#define LVIPR1 PR10_bit.no1
#define PPR10 PR10_bit.no2
#define PPR11 PR10_bit.no3
#define PPR12 PR10_bit.no4
#define PPR13 PR10_bit.no5
#define PPR14 PR10_bit.no6
#define PPR15 PR10_bit.no7
#define DMAPR10 PR10H_bit.no0
#define DMAPR11 PR10H_bit.no1
#define CSIPR100 PR10H_bit.no2
#define STPR10 PR10H_bit.no2
#define CSIPR101 PR10H_bit.no3
#define SRPR10 PR10H_bit.no3
#define SREPR10 PR10H_bit.no4
#define TMPR101H PR10H_bit.no4
#define TMPR100 PR10H_bit.no6
#define TMPR103H PR11_bit.no0
#define IICAPR10 PR11_bit.no1
#define TMPR101 PR11_bit.no2
#define TMPR102 PR11_bit.no3
#define TMPR103 PR11_bit.no4
#define ADPR1 PR11_bit.no5
#define RTCPR1 PR11_bit.no6
#define ITPR1 PR11_bit.no7
#define KRPR1 PR11H_bit.no0
#define TMPR104 PR11H_bit.no4
#define TMPR105 PR11H_bit.no5
#define TMPR106 PR11H_bit.no6
#define TMPR107 PR11H_bit.no7
#define MAA PMC_bit.no0

/*
 Interrupt vector addresses
 */
#define RST_vect (0x0)
#define INTDBG_vect (0x2)
#define INTWDTI_vect (0x4)
#define INTLVI_vect (0x6)
#define INTP0_vect (0x8)
#define INTP1_vect (0xA)
#define INTP2_vect (0xC)
#define INTP3_vect (0xE)
#define INTP4_vect (0x10)
#define INTP5_vect (0x12)
#define INTDMA0_vect (0x14)
#define INTDMA1_vect (0x16)
#define INTCSI00_vect (0x18)
#define INTST0_vect (0x18)
#define INTCSI01_vect (0x1A)
#define INTSR0_vect (0x1A)
#define INTSRE0_vect (0x1C)
#define INTTM01H_vect (0x1C)
#define INTTM00_vect (0x20)
#define INTTM03H_vect (0x24)
#define INTIICA0_vect (0x26)
#define INTTM01_vect (0x28)
#define INTTM02_vect (0x2A)
#define INTTM03_vect (0x2C)
#define INTAD_vect (0x2E)
#define INTRTC_vect (0x30)
#define INTIT_vect (0x32)
#define INTKR_vect (0x34)
#define INTTM04_vect (0x3C)
#define INTTM05_vect (0x3E)
#define INTTM06_vect (0x40)
#define INTTM07_vect (0x42)
#define INTLCD0_vect (0x44)
#define INTP6_vect (0x46)
#define INTP7_vect (0x48)
#define INTMD_vect (0x4A)
#define INTFL_vect (0x4C)
#define BRK_I_vect (0x7E)
#endif
